[
  {
    "table_id": "table_0000",
    "raw_table_id": "table_0000",
    "page_no": 1,
    "bbox": {
      "l": 129.71969604492188,
      "t": 334.5745849609375,
      "r": 482.0517272949219,
      "b": 146.408447265625,
      "coord_origin": "BOTTOMLEFT"
    },
    "caption": "The following definitions shall provide the meaning of certain terms used in this Chapter.",
    "num_rows": 18,
    "num_cols": 2,
    "rows": [
      [
        "BASE SHEAR",
        "Total design lateral force or shear at the base of a structure."
      ],
      [
        "BASIC WIND SPEED",
        "Three-second gust speed at 10 m above the mean ground level in terrain Exposure-B defined in Sec 2.4.6 and associated with an annual probability of occurrence of 0.02."
      ],
      [
        "BEARING WALL SYSTEM",
        "A structural system without a complete vertical load carrying space frame."
      ],
      [
        "BRACED FRAME",
        "An essentially vertical truss system of the concentric or eccentric type which is provided to resist lateral forces."
      ],
      [
        "BUILDING FRAME SYSTEM",
        "An essentially complete space frame which provides support for loads."
      ],
      [
        "CONCENTRIC BRACED FRAME (CBF)",
        "A steel braced frame designed in conformance with Sec 10.20.13 or Sec 10.20.14."
      ],
      [
        "COLLECTOR",
        "A member or element used to transfer lateral forces from a portion of a structure to the vertical elements of the lateral force resisting elements."
      ],
      [
        "DEAD LOAD",
        "The load due to the weight of all permanent structural and nonstructural components of a building or a structure, such as walls, floors, roofs and fixed service equipment."
      ],
      [
        "DIAPHRAGM",
        "A horizontal or nearly horizontal system acting to transmit lateral forces to the vertical resisting elements. The term \"diaphragm\" includes horizontal bracing systems."
      ],
      [
        "DUAL SYSTEM",
        "A combination of Moment Resisting Frames and Shear Walls or Braced Frames to resist lateral loads designed in accordance with the criteria of Sec 1.3.2.4."
      ],
      [
        "ECCENTRIC BRACED FRAME (EBF)",
        "A steel braced frame designed in conformance with Sec 10.20.15."
      ],
      [
        "HORIZONTAL BRACING SYSTEM",
        "A horizontal truss system that serves the same function as a floor or roof diaphragm."
      ],
      [
        "INTERMEDIATE MOMENT FRAME (IMF)",
        "A concrete moment resisting frame designed in accordance with Sec 8.3.10."
      ],
      [
        "LIVE LOAD",
        "The load superimposed by the use and occupancy of a building."
      ],
      [
        "MOMENT RESISTING FRAME",
        "A frame in which members and joints are capable of resisting forces primarily by flexure."
      ],
      [
        "ORDINARY MOMENT FRAME (OMF)",
        "A moment resisting frame not meeting special detailing requirements for ductile behaviour."
      ],
      [
        "PRIMARY FRAMING SYSTEM",
        "That part of the structural system assigned to resist lateral forces."
      ],
      [
        "SHEAR WALL",
        "A wall designed to resist lateral forces parallel to the plane of the wall (sometimes referred to as a vertical diaphragm or a structural wall)."
      ]
    ],
    "page_span": [
      1,
      2
    ]
  },
  {
    "table_id": "table_0002",
    "raw_table_id": "table_0002",
    "page_no": 3,
    "bbox": {
      "l": 129.6790008544922,
      "t": 689.1963729858398,
      "r": 484.2436218261719,
      "b": 149.331298828125,
      "coord_origin": "BOTTOMLEFT"
    },
    "caption": "",
    "num_rows": 13,
    "num_cols": 2,
    "rows": [
      [
        "SLENDER BUILDINGS AND STRUCTURES",
        "Buildings and structures having a height exceeding five times the least horizontal dimension, or having a fundamental natural frequency less than 1 Hz. For those cases where the horizontal dimensions vary with height, the least horizontal dimension at mid height shall be used."
      ],
      [
        "SOFT STOREY",
        "A soft storey is one in which the lateral stiffness is less than 70 percent of that in the storey above or less than 80 percent of the average stiffness of the three storeys above."
      ],
      [
        "SPACE FRAME",
        "A three-dimensional structural system without bearing walls composed of members interconnected so as to function as a complete self-contained unit with or without the aid of horizontal diaphragms or floor bracing systems."
      ],
      [
        "SPECIALMOMENT FRAME (SMF)",
        "A moment resisting frame specially detailed to provide ductile behaviour complying with the requirements of Chapter 8 or 10 for concrete or steel frames respectively."
      ],
      [
        "SPECIAL STRUCTURAL SYSTEM",
        "A structural system not listed in Table 6.1.3 and specially designed to carry the lateral loads. (See Sec 1.3.2.5)."
      ],
      [
        "STOREY",
        "The space between any two floor levels including the roof of a building. Storey-x is the storey below level x."
      ],
      [
        "STOREY SHEAR, GLYPH<1> GLYPH<2>",
        "The summation of design lateral forces above the storey under consideration."
      ],
      [
        "STRENGTH",
        "The usable capacity of an element or a member to resist the load as prescribed in these provisions."
      ],
      [
        "TERRAIN",
        "The ground surface roughness condition when considering the size and arrangement of obstructions to the wind."
      ],
      [
        "THREE-SECOND GUST SPEED",
        "The highest average wind speed over a 3 second duration at a height of 10 m. The three-second gust speed is derived using Durst's model in terms of the mean wind speed and turbulence intensity."
      ],
      [
        "TOWER",
        "A tall, slim vertical structure."
      ],
      [
        "VERTICAL LOAD- CARRYING FRAME",
        "A space frame designed to carry all vertical gravity loads."
      ],
      [
        "WEAKSTOREY",
        "Storey in which the lateral strength is less than 80 percent of that of the storey above."
      ]
    ]
  },
  {
    "table_id": "6.1.1",
    "raw_table_id": "table_0003",
    "page_no": 6,
    "bbox": {
      "l": 126.05374145507812,
      "t": 663.5301361083984,
      "r": 486.0332946777344,
      "b": 148.60009765625,
      "coord_origin": "BOTTOMLEFT"
    },
    "caption": "Table 6.1.1: Occupancy Category of Buildings and other Structures for Flood, Surge, Wind and Earthquake Loads.",
    "num_rows": 16,
    "num_cols": 2,
    "rows": [
      [
        "Nature of Occupancy",
        "Occupancy Category"
      ],
      [
        "Buildings and other structures that represent a low hazard to human life in the event of failure, including, but not limited to: • Agricultural facilities • Certain temporary facilities • Minor storage facilities",
        "I"
      ],
      [
        "All buildings and other structures except those listed in Occupancy Categories I, III and IV",
        "II"
      ],
      [
        "Buildings and other structures that represent a substantial hazard to human life in the event of failure, including, but not limited to: • Buildings and other structures where more than 300 people congregate in one area • Buildings and other structures with day care facilities with a capacity greater than 150 • Buildings and other structures with elementary school or secondary school facilities with a capacity greater than 250 • Buildings and other structures with a capacity greater than 500 for colleges or adult education facilities • Healthcare facilities with a capacity of 50 or more resident patients, but not having surgery or emergency Treatment facilities • Jails and detention facilities Buildings and other structures, not included in Occupancy Category IV, with potential to cause a substantial economic impact and/or mass disruption of day-to-day civilian life in the event of failure, including, but not limited to: • Power generating stations a • Water treatment facilities • Sewage treatment facilities • Telecommunication centers Buildings and other structures not included in Occupancy Category IV",
        "III"
      ],
      [
        "Buildings and other structures designated as essential facilities, including, but not limited to:",
        "IV"
      ],
      [
        " Hospitals and other healthcare facilities having surgery or emergency treatment facilities",
        ""
      ],
      [
        " Fire, rescue, ambulance, and police stations and emergency vehicle garages",
        ""
      ],
      [
        " Designated earthquake, hurricane, or other emergency shelters",
        ""
      ],
      [
        " Designated emergency preparedness, communication, and operation centers and other facilities required for emergency response",
        ""
      ],
      [
        " Power generating stations and other public utility facilities required in an emergency",
        ""
      ],
      [
        " Ancillary structures (including, but not limited to, communication towers, fuel storage tanks, cooling towers,",
        ""
      ],
      [
        " Electrical substation structures, fire water storage tanks or other structures housing or supporting water, or other fire-suppression material or equipment) required for operation of Occupancy Category IV structures during an emergency",
        ""
      ],
      [
        " Aviation control towers, air traffic control centers, and emergency aircraft hangars",
        ""
      ],
      [
        " Community water storage facilities and pump structures required to maintain water pressure for fire suppression",
        ""
      ],
      [
        " Buildings and other structures having critical national defense functions",
        ""
      ],
      [
        "Buildings and other structures (including, but not limited to, facilities that manufacture, process, handle, store, use, or dispose of such substances as hazardous fuels, hazardous chemicals, or hazardous waste) containing highly toxic substances where the quantity of the material exceeds a threshold quantity established by the authority having jurisdiction.",
        ""
      ]
    ],
    "page_span": [
      6,
      7
    ]
  },
  {
    "table_id": "6.1.2",
    "raw_table_id": "table_0005",
    "page_no": 8,
    "bbox": {
      "l": 125.16132354736328,
      "t": 528.9028015136719,
      "r": 486.5834655761719,
      "b": 312.58837890625,
      "coord_origin": "BOTTOMLEFT"
    },
    "caption": "Table 6.1.2: Deflection Limits a, b, c, h (Except earthquake load)",
    "num_rows": 11,
    "num_cols": 4,
    "rows": [
      [
        "Construction",
        "GLYPH<26>",
        "GLYPH<27> GLYPH<28>",
        "GLYPH<29> GLYPH<30> +GLYPH<26>"
      ],
      [
        "Roof members: e",
        "",
        "",
        ""
      ],
      [
        "Supporting plaster ceiling",
        "GLYPH<19>/360",
        "GLYPH<19>/360",
        "GLYPH<19>/240"
      ],
      [
        "Supporting non-plaster ceiling",
        "GLYPH<19>/240",
        "GLYPH<19>/240",
        "GLYPH<19>/180"
      ],
      [
        "Not supporting ceiling",
        "GLYPH<19>/180",
        "GLYPH<19>/180",
        "GLYPH<19>/120"
      ],
      [
        "Floor members",
        "GLYPH<19>/360",
        "-",
        "GLYPH<19>/240"
      ],
      [
        "Exterior walls and interior partitions",
        "",
        "",
        ""
      ],
      [
        "With brittle finishes",
        "-",
        "GLYPH<19>/240",
        ""
      ],
      [
        "With flexible finishes",
        "-",
        "GLYPH<19>/120",
        ""
      ],
      [
        "Farm buildings",
        "-",
        "",
        "GLYPH<19>/180"
      ],
      [
        "Greenhouses",
        "-",
        "",
        "GLYPH<19>/120"
      ]
    ]
  },
  {
    "table_id": "6.1.4",
    "raw_table_id": "table_0006",
    "page_no": 16,
    "bbox": {
      "l": 125.18717193603516,
      "t": 682.2456817626953,
      "r": 487.1035461425781,
      "b": 143.74285888671875,
      "coord_origin": "BOTTOMLEFT"
    },
    "caption": "Table 6.1.4: Vertical Irregularities of Structures",
    "num_rows": 31,
    "num_cols": 3,
    "rows": [
      [
        "Vertical Irregularity",
        "Definition",
        "Reference Section"
      ],
      [
        "Type",
        "",
        ""
      ],
      [
        "I",
        "a. Stiffness Irregularity (Soft Storey):",
        ""
      ],
      [
        "",
        "Soft storey is one in which the lateral stiffness is less than 70",
        "1.7.3.8,"
      ],
      [
        "",
        "percent of that in the storey above or less than 80 percent of",
        "2.5.5 to"
      ],
      [
        "",
        "the average stiffness of the three storeys above.",
        "2.5.14"
      ],
      [
        "",
        "b. Stiffness Irregularity (Extreme Soft Storey):",
        "and"
      ],
      [
        "",
        "Extreme soft storey irregularity is defined to exist where there",
        "2.5.17"
      ],
      [
        "",
        "is a story in which the lateral stiffness is less than 60% of that in the story above or less than 70% of the average stiffness of",
        ""
      ],
      [
        "",
        "the three stories above.",
        ""
      ],
      [
        "II",
        "Mass Irregularity:",
        ""
      ],
      [
        "",
        "Mass irregularity shall be considered to exist where the effective",
        "2.5.5 to"
      ],
      [
        "",
        "mass of any storey is more than 150 percent of the effective mass of an adjacent storey. A roof which is lighter than the floor",
        "2.5.14"
      ],
      [
        "",
        "below need not be considered.",
        ""
      ],
      [
        "III",
        "Vertical Geometric Irregularity:",
        ""
      ],
      [
        "",
        "Vertical geometric irregularity shall be considered to exist",
        "2.5.5 to"
      ],
      [
        "",
        "where horizontal dimension of the lateral force-resisting system in any storey is more than 130 percent of that in an adjacent storey, one-storey penthouses need not be considered.",
        "2.5.14"
      ],
      [
        "IV",
        "In-Plane Discontinuity in Vertical Lateral Force-Resisting",
        ""
      ],
      [
        "",
        "Element:",
        "1.7.3.8,"
      ],
      [
        "",
        "An in-plane offset of the lateral load-resisting elements greater",
        "2.5.5 to"
      ],
      [
        "",
        "than the length of those elements.",
        "2.5.14"
      ],
      [
        "Va",
        "Discontinuity in Capacity (Weak Storey):",
        ""
      ],
      [
        "",
        "A weak storey is one in which the storey strength is less than 80",
        "2.5.5 to"
      ],
      [
        "",
        "percent of that in the storey above. The storey strength is the",
        "2.5.14"
      ],
      [
        "",
        "total strength of all seismic-resisting elements sharing the storey",
        "and"
      ],
      [
        "",
        "shear for the direction under consideration.",
        "2.5.17"
      ],
      [
        "Vb",
        "Extreme Discontinuity in Capacity (Very Weak Storey):",
        ""
      ],
      [
        "",
        "A very weak storey is one in which the storey strength is less",
        "2.5.5 to"
      ],
      [
        "",
        "than 65 percent of that in the storey above.",
        "2.5.14"
      ],
      [
        "",
        "",
        "and"
      ],
      [
        "",
        "",
        "2.5.17"
      ]
    ]
  },
  {
    "table_id": "6.1.5",
    "raw_table_id": "table_0007",
    "page_no": 17,
    "bbox": {
      "l": 124.70130157470703,
      "t": 696.1814575195312,
      "r": 486.6285400390625,
      "b": 147.09429931640625,
      "coord_origin": "BOTTOMLEFT"
    },
    "caption": "Table 6.1.5: Plan (Horizontal) Plan Irregularity",
    "num_rows": 5,
    "num_cols": 3,
    "rows": [
      [
        "Table 6.1.5: Plan (Horizontal) Plan Irregularity",
        "Irregularities of Structures Definition",
        "Reference Section"
      ],
      [
        "I",
        "Torsional Irregularity (to be considered when diaphragms are not flexible):",
        "1.7.3.8,"
      ],
      [
        "II",
        "Reentrant Corners: Plan configurations of a structure and its lateral force-resisting system contain reentrant corners, where both projections of the structure beyond a reentrant corner are greater than 15 percent of the plan dimension of the structure in the given direction.",
        "1.7.3.8, 2.5.5 to 2.5.14"
      ],
      [
        "III",
        "Diaphragm Discontinuity: Diaphragms with abrupt discontinuities or variations in stiffness, including those having cutout or open areas greater than 50 percent of the gross enclosed area of the diaphragm, or changes in effective diaphragm stiffness of more than 50 percent from one storey to the next.",
        "1.7.3.8, 2.5.5 to 2.5.14"
      ],
      [
        "IV Out-of-plane Discontinuities offsets of the V",
        "Offsets: in a lateral force path, such as out-of-plane vertical elements. Nonparallel Systems: The vertical lateral load-resisting elements are not parallel to or symmetric about the major orthogonal axes of the lateral force- resisting system.",
        "1.7.3.8, 2.5.5 to 2.5.14 2.5.5 to 2.5.15"
      ]
    ]
  }
]